# RebarContainerIterator Properties

---
The RebarContainerIterator type exposes the following members.
| Name| Description
---|---|---
| Current| Gets the item at the current position of the iterator.
| CurrentObject|
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RebarContainerIterator Class
Autodesk.Revit.DB.Structure Namespace